app/Http/Controllers/Admin/Auth/LoginController.php

select * from `general_settings` limit 1
---
    public function login(Request $request)
    {

        $this->validateLogin($request);
        $lv = @getLatestVersion();
        $general = GeneralSetting::first();